Autodesk.Revit.DB.Electrical.TemperatureRatingType.AddCorrectionFactor(System.Double,System.Double)
Add a new electrical correction factor type to this temperature rating type. The given temperature
value should be quantified in the document's selected unit of electrical temperature.
temperature: Temperature of correction factor to be added in the document's selected unit of electrical temperature.
factor: Factor of correction factor to be added.
Returns: New constructed correction factor.